Naptick/Naphome_Firmware/samples/korvo_farfield_mic_demo/sdkconfig.defaults
# Korvo-1 Far-Field Microphone Array Demo Default Configuration

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# LED Strip Configuration
CONFIG_KORVO_FARFIELD_LED_GPIO=19
CONFIG_KORVO_FARFIELD_LED_COUNT=12
CONFIG_KORVO_FARFIELD_LED_BRIGHTNESS=32

# Audio Configuration
CONFIG_KORVO_FARFIELD_SAMPLE_RATE=16000
CONFIG_KORVO_FARFIELD_FRAME_SIZE_MS=20

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Partition Table - Custom with model partition for esp-sr
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP-SR WakeNet Model Selection - "hi esp" wake word
CONFIG_SR_WN_WN9_HIESP=y

# Enable wake word detection
CONFIG_KORVO_FARFIELD_WAKE_WORD_ENABLE=y
CONFIG_KORVO_FARFIELD_WAKE_WORD_MODEL="wn9_hiesp"
CONFIG_KORVO_FARFIELD_WAKE_WORD_THRESHOLD=60

# Flash size - Korvo-1 has 8MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
